## Docs
- https://pandas.pydata.org/pandas-docs/stable/10min.html

In [1]:
import pandas as pd

In [28]:
df = pd.read_excel('mdtr_city.xlsx')

In [ ]:
df.columns(CNPJ	Outlet	Cidade	2017/09	2017/10	2017/11	Total Geral
')

In [29]:
df.describe()

,Cx Pad Mensal,Unnamed: 1,Unnamed: 2,Competencia,Unnamed: 4,Unnamed: 5,Unnamed: 6
count,31339,31338,31333,24123,24601,7200,31339
unique,31339,12533,3354,348,370,89,555
top,61585865148060,FARMACIAS PAGUE MENOS,SAO PAULO,1,1,1,1
freq,1,1012,2307,5295,5360,2638,5380

In [30]:
df.head(5)

,Cx Pad Mensal,Unnamed: 1,Unnamed: 2,Competencia,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,CNPJ,Outlet,Cidade,2017/09,2017/10,2017/11,Total Geral
1,00002903000101,DROG STA RITA DE CANDIDO,CANDIDO MOTA,2,2,NaN,4
2,00005391000137,DROGARIA FARMA CRUZ,FRANCA,2,3,NaN,5
3,00006037000470,HOSPITAL UNIMED TATUI-JOSE FCO.M.DE ALMEIDA - DR.,TATUI,NaN,1,NaN,1
4,00006290000180,DROGARIA CAMPEA POPULAR,SAO PAULO,3,2,NaN,5

In [26]:
df.columns

Index(['Cx Pad Mensal', 'Unnamed: 1', 'Unnamed: 2', 'Competencia',
       'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6'],
      dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=31339, step=1)

In [13]:
df_csv = pd.read_csv('mdtr_city.csv', sep=';')

In [18]:
print(df_csv['2903000101'])

0         5391000137
1         6037000470
2         6290000180
3         6290000199
4         6486000175
5        11976000160
6        13246000106
7        17373000175
8        19968000160
9        20717000103
10       22548000132
11       25528000115
12       28656000112
13       28656000199
14       30181000107
15       30181000280
16       30181000360
17       30181000603
18       30181000794
19       30181000875
20       30181000956
21       32532000100
22       37259000107
23       49791000144
24       53082000132
25       58542000115
26       58816000176
27       59344000176
28       60726000110
29       61325000184
            ...
31307      BN0852023
31308      BN0856001
31309      BN0856002
31310      BN0856004
31311      BN0856005
31312      BN0860011
31313      BN1071001
31314      BN1073001
31315      BN1074001
31316      BN1080001
31317      BN1081007
31318      BN1081021
31319      BN1082001
31320      BN1082013
31321      BN1089001
31322      BN1092001
31323      BN1092002
31324      BN1093011
31325      BN1099002
31326      BN1105006
31327      BN1171001
31328      BN1176001
31329      BN1219001
31330      BN1221002
31331      BN1241009
31332      BN1322019
31333      BO8152001
31334      BO8162001
31335      BO8837008
31336    Total Geral
Name: 2903000101, Length: 31337, dtype: object